import path from "path";
import { fileURLToPath } from "url";
import { readFile } from "fs/promises";

const __dirname = path.dirname(fileURLToPath(import.meta.url));

// prettier-ignore
export var EEWSect = { 135: "宗谷支庁北部", 136: "宗谷支庁南部", 125: "上川支庁北部", 126: "上川支庁中部", 127: "上川支庁南部", 130: "留萌支庁中北部", 131: "留萌支庁南部", 139: "北海道利尻礼文", 150: "日高支庁西部", 151: "日高支庁中部", 152: "日高支庁東部", 145: "胆振支庁西部", 146: "胆振支庁中東部", 110: "檜山支庁", 105: "渡島支庁北部", 106: "渡島支庁東部", 107: "渡島支庁西部", 140: "網走支庁網走", 141: "網走支庁北見", 142: "網走支庁紋別", 165: "根室支庁北部", 166: "根室支庁中部", 167: "根室支庁南部", 160: "釧路支庁北部", 161: "釧路支庁中南部", 155: "十勝支庁北部", 156: "十勝支庁中部", 157: "十勝支庁南部", 119: "北海道奥尻島", 120: "空知支庁北部", 121: "空知支庁中部", 122: "空知支庁南部", 100: "石狩支庁北部", 101: "石狩支庁中部", 102: "石狩支庁南部", 115: "後志支庁北部", 116: "後志支庁東部", 117: "後志支庁西部", 200: "青森県津軽北部", 201: "青森県津軽南部", 202: "青森県三八上北", 203: "青森県下北", 230: "秋田県沿岸北部", 231: "秋田県沿岸南部", 232: "秋田県内陸北部", 233: "秋田県内陸南部", 210: "岩手県沿岸北部", 211: "岩手県沿岸南部", 212: "岩手県内陸北部", 213: "岩手県内陸南部", 220: "宮城県北部", 221: "宮城県南部", 222: "宮城県中部", 240: "山形県庄内", 241: "山形県最上", 242: "山形県村山", 243: "山形県置賜", 250: "福島県中通り", 251: "福島県浜通り", 252: "福島県会津", 300: "茨城県北部", 301: "茨城県南部", 310: "栃木県北部", 311: "栃木県南部", 320: "群馬県北部", 321: "群馬県南部", 330: "埼玉県北部", 331: "埼玉県南部", 332: "埼玉県秩父", 350: "東京都２３区", 351: "東京都多摩東部", 352: "東京都多摩西部", 354: "神津島", 355: "伊豆大島", 356: "新島", 357: "三宅島", 358: "八丈島", 359: "小笠原", 340: "千葉県北東部", 341: "千葉県北西部", 342: "千葉県南部", 360: "神奈川県東部", 361: "神奈川県西部", 420: "長野県北部", 421: "長野県中部", 422: "長野県南部", 410: "山梨県東部", 411: "山梨県中・西部", 412: "山梨県東部・富士五湖", 440: "静岡県伊豆", 441: "静岡県東部", 442: "静岡県中部", 443: "静岡県西部", 450: "愛知県東部", 451: "愛知県西部", 430: "岐阜県飛騨", 431: "岐阜県美濃東部", 432: "岐阜県美濃中西部", 460: "三重県北部", 461: "三重県中部", 462: "三重県南部", 370: "新潟県上越", 371: "新潟県中越", 372: "新潟県下越", 375: "新潟県佐渡", 380: "富山県東部", 381: "富山県西部", 390: "石川県能登", 391: "石川県加賀", 400: "福井県嶺北", 401: "福井県嶺南", 500: "滋賀県北部", 501: "滋賀県南部", 510: "京都府北部", 511: "京都府南部", 520: "大阪府北部", 521: "大阪府南部", 530: "兵庫県北部", 531: "兵庫県南東部", 532: "兵庫県南西部", 535: "兵庫県淡路島", 540: "奈良県", 550: "和歌山県北部", 551: "和歌山県南部", 580: "岡山県北部", 581: "岡山県南部", 590: "広島県北部", 591: "広島県南東部", 592: "広島県南西部", 570: "島根県東部", 571: "島根県西部", 575: "島根県隠岐", 560: "鳥取県東部", 562: "鳥取県中部", 563: "鳥取県西部", 600: "徳島県北部", 601: "徳島県南部", 610: "香川県東部", 611: "香川県西部", 620: "愛媛県東予", 621: "愛媛県中予", 622: "愛媛県南予", 630: "高知県東部", 631: "高知県中部", 632: "高知県西部", 700: "山口県北部", 701: "山口県東部", 702: "山口県西部", 710: "福岡県福岡", 711: "福岡県北九州", 712: "福岡県筑豊", 713: "福岡県筑後", 750: "大分県北部", 751: "大分県中部", 752: "大分県南部", 753: "大分県西部", 730: "長崎県北部", 731: "長崎県南西部", 732: "長崎県島原半島", 735: "長崎県対馬", 736: "長崎県壱岐", 737: "長崎県五島", 720: "佐賀県北部", 721: "佐賀県南部", 740: "熊本県阿蘇", 741: "熊本県熊本", 742: "熊本県球磨", 743: "熊本県天草・芦北", 760: "宮崎県北部平野部", 761: "宮崎県北部山沿い", 762: "宮崎県南部平野部", 763: "宮崎県南部山沿い", 770: "鹿児島県薩摩", 771: "鹿児島県大隅", 774: "鹿児島県十島村", 775: "鹿児島県甑島", 776: "鹿児島県種子島", 777: "鹿児島県屋久島", 778: "鹿児島県奄美北部", 779: "鹿児島県奄美南部", 800: "沖縄県本島北部", 801: "沖縄県本島中南部", 802: "沖縄県久米島", 803: "沖縄県大東島", 804: "沖縄県宮古島", 805: "沖縄県石垣島", 806: "沖縄県与那国島", 807: "沖縄県西表島" };

// prettier-ignore
export var KmoniColorTable = { "0": { "r": 63, "g": 250, "b": 54 }, "1": { "r": 189, "g": 255, "b": 12 }, "2": { "r": 255, "g": 255, "b": 0 }, "3": { "r": 255, "g": 221, "b": 0 }, "4": { "r": 255, "g": 144, "b": 0 }, "5": { "r": 255, "g": 68, "b": 0 }, "6": { "r": 245, "g": 0, "b": 0 }, "7": { "r": 170, "g": 0, "b": 0 }, "-3": { "r": 0, "g": 0, "b": 205 }, "-2.9": { "r": 0, "g": 7, "b": 209 }, "-2.8": { "r": 0, "g": 14, "b": 214 }, "-2.7": { "r": 0, "g": 21, "b": 218 }, "-2.6": { "r": 0, "g": 28, "b": 223 }, "-2.5": { "r": 0, "g": 36, "b": 227 }, "-2.4": { "r": 0, "g": 43, "b": 231 }, "-2.3": { "r": 0, "g": 50, "b": 236 }, "-2.2": { "r": 0, "g": 57, "b": 240 }, "-2.1": { "r": 0, "g": 64, "b": 245 }, "-2": { "r": 0, "g": 72, "b": 250 }, "-1.9": { "r": 0, "g": 85, "b": 238 }, "-1.8": { "r": 0, "g": 99, "b": 227 }, "-1.7": { "r": 0, "g": 112, "b": 216 }, "-1.6": { "r": 0, "g": 126, "b": 205 }, "-1.5": { "r": 0, "g": 140, "b": 194 }, "-1.4": { "r": 0, "g": 153, "b": 183 }, "-1.3": { "r": 0, "g": 167, "b": 172 }, "-1.2": { "r": 0, "g": 180, "b": 161 }, "-1.1": { "r": 0, "g": 194, "b": 150 }, "-1": { "r": 0, "g": 208, "b": 139 }, "-0.9": { "r": 6, "g": 212, "b": 130 }, "-0.8": { "r": 12, "g": 216, "b": 121 }, "-0.7": { "r": 18, "g": 220, "b": 113 }, "-0.6": { "r": 25, "g": 224, "b": 104 }, "-0.5": { "r": 31, "g": 228, "b": 96 }, "-0.4": { "r": 37, "g": 233, "b": 88 }, "-0.3": { "r": 44, "g": 237, "b": 79 }, "-0.2": { "r": 50, "g": 241, "b": 71 }, "-0.1": { "r": 56, "g": 245, "b": 62 }, "0.1": { "r": 75, "g": 250, "b": 49 }, "0.2": { "r": 88, "g": 250, "b": 45 }, "0.3": { "r": 100, "g": 251, "b": 41 }, "0.4": { "r": 113, "g": 251, "b": 37 }, "0.5": { "r": 125, "g": 252, "b": 33 }, "0.6": { "r": 138, "g": 252, "b": 28 }, "0.7": { "r": 151, "g": 253, "b": 24 }, "0.8": { "r": 163, "g": 253, "b": 20 }, "0.9": { "r": 176, "g": 254, "b": 16 }, "1.1": { "r": 195, "g": 254, "b": 10 }, "1.2": { "r": 202, "g": 254, "b": 9 }, "1.3": { "r": 208, "g": 254, "b": 8 }, "1.4": { "r": 215, "g": 254, "b": 7 }, "1.5": { "r": 222, "g": 255, "b": 5 }, "1.6": { "r": 228, "g": 254, "b": 4 }, "1.7": { "r": 235, "g": 255, "b": 3 }, "1.8": { "r": 241, "g": 254, "b": 2 }, "1.9": { "r": 248, "g": 255, "b": 1 }, "2.1": { "r": 254, "g": 251, "b": 0 }, "2.2": { "r": 254, "g": 248, "b": 0 }, "2.3": { "r": 254, "g": 244, "b": 0 }, "2.4": { "r": 254, "g": 241, "b": 0 }, "2.5": { "r": 255, "g": 238, "b": 0 }, "2.6": { "r": 254, "g": 234, "b": 0 }, "2.7": { "r": 255, "g": 231, "b": 0 }, "2.8": { "r": 254, "g": 227, "b": 0 }, "2.9": { "r": 255, "g": 224, "b": 0 }, "3.1": { "r": 254, "g": 213, "b": 0 }, "3.2": { "r": 254, "g": 205, "b": 0 }, "3.3": { "r": 254, "g": 197, "b": 0 }, "3.4": { "r": 254, "g": 190, "b": 0 }, "3.5": { "r": 255, "g": 182, "b": 0 }, "3.6": { "r": 254, "g": 174, "b": 0 }, "3.7": { "r": 255, "g": 167, "b": 0 }, "3.8": { "r": 254, "g": 159, "b": 0 }, "3.9": { "r": 255, "g": 151, "b": 0 }, "4.1": { "r": 254, "g": 136, "b": 0 }, "4.2": { "r": 254, "g": 128, "b": 0 }, "4.3": { "r": 254, "g": 121, "b": 0 }, "4.4": { "r": 254, "g": 113, "b": 0 }, "4.5": { "r": 255, "g": 106, "b": 0 }, "4.6": { "r": 254, "g": 98, "b": 0 }, "4.7": { "r": 255, "g": 90, "b": 0 }, "4.8": { "r": 254, "g": 83, "b": 0 }, "4.9": { "r": 255, "g": 75, "b": 0 }, "5.1": { "r": 254, "g": 61, "b": 0 }, "5.2": { "r": 253, "g": 54, "b": 0 }, "5.3": { "r": 252, "g": 47, "b": 0 }, "5.4": { "r": 251, "g": 40, "b": 0 }, "5.5": { "r": 250, "g": 33, "b": 0 }, "5.6": { "r": 249, "g": 27, "b": 0 }, "5.7": { "r": 248, "g": 20, "b": 0 }, "5.8": { "r": 247, "g": 13, "b": 0 }, "5.9": { "r": 246, "g": 6, "b": 0 }, "6.1": { "r": 238, "g": 0, "b": 0 }, "6.2": { "r": 230, "g": 0, "b": 0 }, "6.3": { "r": 223, "g": 0, "b": 0 }, "6.4": { "r": 215, "g": 0, "b": 0 }, "6.5": { "r": 208, "g": 0, "b": 0 }, "6.6": { "r": 200, "g": 0, "b": 0 }, "6.7": { "r": 192, "g": 0, "b": 0 }, "6.8": { "r": 185, "g": 0, "b": 0 }, "6.9": { "r": 177, "g": 0, "b": 0 } };

// prettier-ignore
export var EQIAreaLoc = { "石狩地方北部": [141.54675, 43.43578], "石狩地方中部": [141.23705, 42.98504], "石狩地方南部": [141.52402, 42.85309], "渡島地方北部": [140.18512, 42.32746], "渡島地方東部": [140.693, 41.94338], "渡島地方西部": [140.31204, 41.60581], "檜山地方": [139.9998, 42.3766], "後志地方北部": [140.81871, 43.16516], "後志地方東部": [140.85942, 42.83641], "後志地方西部": [140.53046, 42.91356], "北海道奥尻島": [139.46697, 42.15214], "空知地方北部": [142.01984, 43.84019], "空知地方中部": [142.04045, 43.47655], "空知地方南部": [141.94768, 43.14824], "上川地方北部": [142.42944, 44.40536], "上川地方中部": [142.67244, 43.7236], "上川地方南部": [142.50933, 43.21754], "留萌地方中北部": [141.90835, 44.54206], "留萌地方南部": [141.77079, 43.94982], "宗谷地方北部": [141.94211, 45.20023], "宗谷地方南部": [142.39298, 44.88518], "北海道利尻礼文": [141.23048, 45.17836], "網走地方": [144.48047, 43.90311], "北見地方": [143.79168, 43.84761], "紋別地方": [143.30967, 44.19196], "胆振地方西部": [140.82689, 42.60353], "胆振地方中東部": [141.39009, 42.64401], "日高地方西部": [142.37647, 42.7154], "日高地方中部": [142.59539, 42.47374], "日高地方東部": [142.93003, 42.19558], "十勝地方北部": [143.32314, 43.32573], "十勝地方中部": [143.28856, 42.87941], "十勝地方南部": [143.15465, 42.44626], "釧路地方北部": [144.39781, 43.54639], "釧路地方中南部": [144.51042, 43.20982], "根室地方北部": [145.00385, 43.90127], "根室地方中部": [144.95723, 43.41467], "根室地方南部": [145.34732, 43.27908], "青森県津軽北部": [140.4857, 40.93446], "青森県津軽南部": [140.36289, 40.59874], "青森県三八上北": [141.20052, 40.68776], "青森県下北": [141.11944, 41.32661], "岩手県沿岸北部": [141.75098, 39.92458], "岩手県沿岸南部": [141.71304, 39.23375], "岩手県内陸北部": [141.21093, 39.93023], "岩手県内陸南部": [141.09343, 39.1759], "宮城県北部": [141.08257, 38.72049], "宮城県南部": [140.60006, 38.02044], "宮城県中部": [140.90636, 38.40323], "秋田県沿岸北部": [140.11294, 40.1368], "秋田県沿岸南部": [140.15039, 39.43931], "秋田県内陸北部": [140.56991, 40.15347], "秋田県内陸南部": [140.47855, 39.43633], "山形県庄内": [139.87396, 38.72509], "山形県最上": [140.32742, 38.77739], "山形県村山": [140.24408, 38.38752], "山形県置賜": [139.97007, 38.0049], "福島県中通り": [140.37852, 37.38397], "福島県浜通り": [140.94343, 37.38026], "福島県会津": [139.63988, 37.38346], "茨城県北部": [140.44279, 36.53773], "茨城県南部": [140.21035, 36.07702], "栃木県北部": [139.8116, 36.87802], "栃木県南部": [139.84548, 36.52125], "群馬県北部": [139.01583, 36.72978], "群馬県南部": [139.03612, 36.30946], "埼玉県北部": [139.43115, 36.11991], "埼玉県南部": [139.49001, 35.93128], "埼玉県秩父": [138.94888, 35.99408], "千葉県北東部": [140.44757, 35.63605], "千葉県北西部": [140.16283, 35.66762], "千葉県南部": [140.10234, 35.19097], "東京都２３区": [139.73616, 35.67495], "東京都多摩東部": [139.38037, 35.65425], "東京都多摩西部": [139.1547, 35.7822], "神津島": [139.15228, 34.21408], "伊豆大島": [139.40239, 34.73847], "新島": [139.21407, 34.32634], "三宅島": [139.52125, 34.08539], "八丈島": [139.80768, 33.10241], "小笠原": [141.3198, 24.7791], "神奈川県東部": [139.49668, 35.38991], "神奈川県西部": [139.14266, 35.40645], "新潟県上越": [138.17565, 37.03639], "新潟県中越": [138.83942, 37.23676], "新潟県下越": [139.44225, 38.0003], "新潟県佐渡": [138.35139, 38.0673], "富山県東部": [137.42681, 36.67474], "富山県西部": [136.91921, 36.62078], "石川県能登": [136.79615, 37.14454], "石川県加賀": [136.59766, 36.4297], "福井県嶺北": [136.35588, 35.97698], "福井県嶺南": [135.96354, 35.55479], "山梨県中・西部": [138.5194, 35.57003], "山梨県東部・富士五湖": [138.95487, 35.60847], "長野県北部": [138.139, 36.68361], "長野県中部": [138.08506, 36.16776], "長野県南部": [137.87913, 35.6424], "岐阜県飛騨": [137.19971, 36.04247], "岐阜県美濃東部": [137.30969, 35.51208], "岐阜県美濃中西部": [136.68755, 35.60052], "静岡県伊豆": [138.95185, 34.89169], "静岡県東部": [138.75944, 35.19231], "静岡県中部": [138.30691, 35.13232], "静岡県西部": [137.84768, 34.94967], "愛知県東部": [137.52624, 34.90666], "愛知県西部": [137.16109, 35.05975], "三重県北部": [136.57907, 35.02821], "三重県中部": [136.29628, 34.60764], "三重県南部": [136.19401, 34.1446], "滋賀県北部": [136.15375, 35.41752], "滋賀県南部": [136.11841, 35.03771], "京都府北部": [135.17996, 35.46993], "京都府南部": [135.59642, 35.04177], "大阪府北部": [135.58859, 34.79913], "大阪府南部": [135.50817, 34.44004], "兵庫県北部": [134.70365, 35.40012], "兵庫県南東部": [135.07489, 34.96647], "兵庫県南西部": [134.56049, 35.03026], "兵庫県淡路島": [134.83253, 34.39891], "奈良県": [135.89674, 34.3202], "和歌山県北部": [135.33995, 34.0628], "和歌山県南部": [135.63744, 33.75076], "鳥取県東部": [134.2345, 35.3919], "鳥取県中部": [133.79765, 35.38716], "鳥取県西部": [133.43964, 35.30505], "島根県東部": [132.95331, 35.27622], "島根県西部": [132.08681, 34.78736], "島根県隠岐": [133.2763, 36.25405], "岡山県北部": [133.85634, 35.10442], "岡山県南部": [133.80639, 34.6947], "広島県北部": [132.84361, 34.80103], "広島県南東部": [133.14532, 34.59501], "広島県南西部": [132.49039, 34.40867], "徳島県北部": [134.15068, 34.01571], "徳島県南部": [134.31538, 33.76563], "香川県東部": [134.16606, 34.25569], "香川県西部": [133.82632, 34.20103], "愛媛県東予": [133.44723, 33.94659], "愛媛県中予": [132.91864, 33.74242], "愛媛県南予": [132.64041, 33.27646], "高知県東部": [134.09693, 33.4822], "高知県中部": [133.47726, 33.61205], "高知県西部": [132.90471, 33.10141], "山口県北部": [131.41539, 34.3815], "山口県西部": [130.99428, 34.14127], "山口県東部": [132.10386, 34.15051], "山口県中部": [131.6771, 34.23622], "福岡県福岡": [130.4963, 33.64257], "福岡県北九州": [130.94544, 33.72879], "福岡県筑豊": [130.74432, 33.63414], "福岡県筑後": [130.62192, 33.25556], "佐賀県北部": [129.9974, 33.35641], "佐賀県南部": [130.13544, 33.21836], "長崎県北部": [129.73617, 33.19129], "長崎県南西部": [130.00364, 32.83446], "長崎県島原半島": [130.29003, 32.73602], "長崎県対馬": [129.36201, 34.50103], "長崎県壱岐": [129.70993, 33.78369], "長崎県五島": [128.75554, 32.68612], "熊本県阿蘇": [131.10776, 32.9743], "熊本県熊本": [130.91671, 32.75494], "熊本県球磨": [130.84598, 32.29696], "熊本県天草・芦北": [130.1034, 32.36995], "大分県北部": [131.19514, 33.501], "大分県中部": [131.4288, 33.25512], "大分県南部": [131.70822, 32.92816], "大分県西部": [131.21244, 33.14283], "宮崎県北部平野部": [131.56893, 32.42842], "宮崎県北部山沿い": [131.26067, 32.48259], "宮崎県南部平野部": [131.3663, 31.74618], "宮崎県南部山沿い": [131.0424, 31.89712], "鹿児島県薩摩": [130.4553, 31.67134], "鹿児島県大隅": [130.89609, 31.40053], "鹿児島県十島村": [129.86608, 29.8501], "鹿児島県甑島": [129.88505, 31.84194], "鹿児島県種子島": [130.99595, 30.5918], "鹿児島県屋久島": [130.52448, 30.34791], "鹿児島県奄美北部": [129.39683, 28.31986], "鹿児島県奄美南部": [128.58819, 27.38427], "沖縄県本島北部": [128.16633, 26.64532], "沖縄県本島中南部": [127.74713, 26.26225], "沖縄県久米島": [126.78815, 26.34114], "沖縄県大東島": [131.2429, 25.84249], "沖縄県宮古島": [124.69963, 24.65816], "沖縄県石垣島": [124.23828, 24.47049], "沖縄県与那国島": [122.98771, 24.45599], "沖縄県西表島": [123.83915, 24.34639], "色丹島": [146.70781, 43.79579], "国後島": [145.81289, 44.08527], "択捉島": [147.83756, 44.99076], "鷹島(甑島南方)": [129.73294, 31.44904], "津倉瀬(宇治群島北東方）": [129.74011, 31.30856], "うるま市・金武町境界部地先の埋立地": [127.84314, 26.43409] }


export const FERegion = JSON.parse(
  await readFile(path.join(__dirname, "../Resource/feRegion.json"))
);

export var TTT_JMA2001 = JSON.parse(
  await readFile(path.join(__dirname, "../Resource/TimeTable_JMA2001.json"))
);
export var TTT_AK135 = JSON.parse(
  await readFile(path.join(__dirname, "../Resource/ak135table.json"))
);

export var JMA_Int_Points = JSON.parse(
  await readFile(path.join(__dirname, "../Resource/JMA_Int_Points.json"))
);

export function ParseJSON(str) {
  try {
    str = String(str);
    var json = JSON.parse(str);
  } catch {
    return null;
  }
  return json;
}


//日時フォーマット
export function NormalizeDate(type, date) {
  try {
    if (!date) date = new Date();
    else date = new Date(date);
    if (Number.isNaN(date.getTime())) throw new Error();

    var YYYY = String(date.getFullYear());
    var YY = String(date.getFullYear()).slice(-2);
    var MM = String(date.getMonth() + 1).padStart(2, "0");
    var DD = String(date.getDate()).padStart(2, "0");
    var hh = String(date.getHours()).padStart(2, "0");
    var mm = String(date.getMinutes()).padStart(2, "0");
    var ss = String(date.getSeconds()).padStart(2, "0");
    var M = String(date.getMonth() + 1);
    var D = String(date.getDate());
    var h = String(date.getHours());
    var m = String(date.getMinutes());
    var s = String(date.getSeconds());
    var isToday = date.toDateString() == new Date().toDateString();
    if (typeof type === "string" || type instanceof String) {
      return type.replaceAll("YYYY", YYYY).replaceAll("YY", YY).replaceAll("MM", MM).replaceAll("DD", DD).replaceAll("hh", hh).replaceAll("mm", mm).replaceAll("ss", ss).replaceAll("M", M).replaceAll("D", D).replaceAll("h", h).replaceAll("m", m).replaceAll("s", s);
    }
    switch (type) {
      case 1:
        return `${YYYY}${MM}${DD}${hh}${mm}${ss}`;
      case 2:
        return `${YYYY}${MM}${DD}`;
      case 3:
        return `${YYYY}/${MM}/${DD} ${hh}:${mm}:${ss}`;
      case 4:
        return `${YYYY}/${MM}/${DD} ${hh}:${mm}`;
      case 5:
        return `${D}日 ${hh}:${mm}`;
      case 6:
        return `${hh}:${mm}`;
      case 7:
        return `${hh}時${mm}分${ss}秒`;
      case 8:
        return `${h}時${m}分${s}秒`;
      case 9:
        var date_str = "";
        if (!isToday) date_str = `${D}日 `;
        return `${date_str}${h}時${m}分`;
      case 10:
        var date_str = "";
        if (!isToday) date_str = `${D}日 `;
        return `${date_str}${hh}:${mm}`;
      default:
        return new Date().toLocaleString("ja-jp");
    }
  } catch {
    return new Date().toLocaleString("ja-jp");
  }
}
//震度の形式変換

export const DefaultShindoColor = {
  "0": { "background": "rgb(80, 81, 83)", "color": "rgb(194, 195, 197)" },
  "1": { "background": "rgb(157, 175, 194)", "color": "rgb(61, 64, 89)" },
  "2": { "background": "rgb(89, 123, 171)", "color": "rgb(0, 1, 6)" },
  "3": { "background": "rgb(69, 72, 130)", "color": "rgb(216, 217, 235)" },
  "4": { "background": "rgb(217, 215, 98)", "color": "rgb(67, 67, 71)" },
  "7": { "background": "rgb(165, 0, 194)", "color": "rgb(255, 255, 255)" },
  "5m": { "background": "rgb(224, 157, 0)", "color": "rgb(38, 38, 38)" },
  "5p": { "background": "rgb(232, 93, 19)", "color": "rgb(0, 0, 0)" },
  "6m": { "background": "rgb(194, 26, 0)", "color": "rgb(255, 255, 255)" },
  "6p": { "background": "rgb(128, 0, 21)", "color": "rgb(255, 255, 255)" },
  "?": { "background": "rgb(191, 191, 191)", "color": "rgb(68, 68, 68)" },
  "5p?": { "background": "rgb(232, 93, 19)", "color": "rgb(0, 0, 0)" }
};

//震度の形式変換
export function NormalizeShindo(str, responseType) {
  try {
    var p2p_table = { "10": 1, "20": 2, "30": 3, "40": 4, "45": 5, "50": 6, "55": 7, "60": 8, "70": 9 }
    var IntIndex = 11;
    if (str === null || str === undefined) {
      IntIndex = 11;//不明
    } else if (p2p_table[str]) {
      IntIndex = p2p_table[str]//p2pの2桁フォーマット
    } else if (isNaN(str)) {
      str = String(str)
        .replace(/[０-９]/g, function (s) {
          return String.fromCharCode(s.charCodeAt(0) - 0xfee0);
        }).replaceAll("＋", "+").replaceAll("－", "-").replaceAll("強", "+").replaceAll("弱", "-").replace(/\s+/g, "");
      switch (str) {
        case "1":
          IntIndex = 1;
          break;
        case "2":
          IntIndex = 2;
          break;
        case "3":
          IntIndex = 3;
          break;
        case "4":
          IntIndex = 4;
          break;
        case "5-":
          IntIndex = 5;
          break;
        case "5+":
          IntIndex = 6;
          break;
        case "6-":
          IntIndex = 7;
          break;
        case "6+":
          IntIndex = 8;
          break;
        case "7":
          IntIndex = 9;
          break;
        case "未":
        case "５弱以上未入電":
        case "震度5-以上未入電":
        case "5+?":
          IntIndex = 10;
          break;
        case "-1":
        case "?":
        case "不明":
        default:
          IntIndex = 11;
      }
    } else {
      if (str < 0.5) IntIndex = 0;
      else if (str < 1.5) IntIndex = 1;
      else if (str < 2.5) IntIndex = 2;
      else if (str < 3.5) IntIndex = 3;
      else if (str < 4.5) IntIndex = 4;
      else if (str < 5) IntIndex = 5;
      else if (str < 5.5) IntIndex = 6;
      else if (str < 6) IntIndex = 7;
      else if (str < 6.5) IntIndex = 8;
      else if (6.5 <= str) IntIndex = 9;
      else IntIndex = 11;
    }
    switch (responseType) {
      case 1:
        var ConvTable = ["0", "1", "2", "3", "4", "5弱", "5強", "6弱", "6強", "7", "５弱以上未入電", "不明",];
        break;
      case 2:
        var shindoColor = DefaultShindoColor;
        var ConvTable = [
          [shindoColor["0"].background, shindoColor["0"].color],
          [shindoColor["1"].background, shindoColor["1"].color],
          [shindoColor["2"].background, shindoColor["2"].color],
          [shindoColor["3"].background, shindoColor["3"].color],
          [shindoColor["4"].background, shindoColor["4"].color],
          [shindoColor["5m"].background, shindoColor["5m"].color],
          [shindoColor["5p"].background, shindoColor["5p"].color],
          [shindoColor["6m"].background, shindoColor["6m"].color],
          [shindoColor["6p"].background, shindoColor["6p"].color],
          [shindoColor["7"].background, shindoColor["7"].color],
          [shindoColor["5p?"].background, shindoColor["5p?"].color],
          [shindoColor["?"].background, shindoColor["?"].color],
        ];
        break;
      case 3:
        var ConvTable = [null, "1", "2", "3", "4", "5m", "5p", "6m", "6p", "7", "5p?", null,
        ];
        break;
      case 4:
        var ConvTable = [0, 1, 2, 3, 4, 4.5, 5, 5.5, 6, 7, 4.5, null];
        break;
      case 5:
        var ConvTable = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 4.5, 0];
        break;
      case 0:
      default:
        var ConvTable = ["0", "1", "2", "3", "4", "5-", "5+", "6-", "6+", "7", "未", "?"];
        break;
    }
    return ConvTable[IntIndex];
  } catch {
    return "?";
  }
}


export function ConvertJST(time) {
  try {
    var copy = new Date(time);
    copy.setHours(copy.getHours() + 9)
    return copy;
  } catch (err) {
    throw new Error("内部の情報処理でエラーが発生しました。(タイムゾーンの変換 - UTC to JST)", { cause: err });
  }
}

export function ConvertUTC(time) {
  try {
    var copy = new Date(time)
    copy.setHours(copy.getHours() - 9)
    return copy;
  } catch (err) {
    throw new Error("内部の情報処理でエラーが発生しました。(タイムゾーンの変換 - JST to UTC)", { cause: err });
  }
}

export function Boolean2(elm) {
  return Boolean(elm !== null && elm !== undefined && elm !== "" && !Number.isNaN(elm) && elm != "Invalid Date" && (!Array.isArray(elm) || elm.length > 0) && elm || elm === 0);
}


export function newDate2(e) {
  var dt = new Date(e);

  const isInvalidDate = Number.isNaN(dt.getTime());
  if (dt && !isInvalidDate) return dt
  else return null;
}


export function IncludesDuplicates(arr1, arr2) {
  const a1 = Array.isArray(arr1) ? arr1 : [];
  const a2 = Array.isArray(arr2) ? arr2 : [];

  return a1.some(item => a2.includes(item));
}


export function throttle(cb, delay = 1000) {
  let shouldWait = false
  let waitingArgs
  const timeoutFunc = () => {
    if (waitingArgs == null) {
      shouldWait = false
    } else {
      cb(...waitingArgs)
      waitingArgs = null
      setTimeout(timeoutFunc, delay)
    }
  }

  return (...args) => {
    if (shouldWait) {
      waitingArgs = args
      return
    }

    cb(...args)
    shouldWait = true
    setTimeout(timeoutFunc, delay)
  }
}
